In [5]:
import pandas as pd
df = pd.DataFrame({'A': {0: 'a', 1: 'b', 2: 'c'},
                   'B': {0: 1, 1: 3, 2: 5},
                   'C': {0: 2, 1: 4, 2: 6}})
df

   A  B  C
0  a  1  2
1  b  3  4
2  c  5  6

In [6]:
pd.melt(df, id_vars=['A'], value_vars=['B'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5

In [14]:
pd.cut([0, 1, 1, 2], bins=4, labels=False)

array([0, 1, 1, 3])

In [15]:
pd.qcut(range(5), 4, labels=False)

array([0, 0, 1, 2, 3])

In [20]:
df1 = pd.DataFrame({'left': ['one', 'two']})
df2 = pd.DataFrame({'right': [7, 8]})
df1     #pandas.merge function

  left
0  one
1  two

In [23]:
s1 = pd.Series(['a', 'b'])
s2 = pd.Series(['c', 'd'])
pd.concat([s1, s2])

0    a
1    b
0    c
1    d
dtype: object

In [24]:
s = pd.Series(list('abca'))
pd.get_dummies(s)

   a  b  c
0  1  0  0
1  0  1  0
2  0  0  1
3  1  0  0

In [25]:
codes, uniques = pd.factorize(['b', 'b', 'a', 'c', 'b'])
codes

array([0, 0, 1, 2, 0])

In [26]:
pd.unique(pd.Series([2, 1, 3, 3]))

array([2, 1, 3])

In [30]:
pd.isna('dog')

False

In [31]:
pd.isna(pd.NA)

True

In [33]:
pd.notna('dog')

True

In [34]:
pd.notna(pd.NA)

False

In [36]:
s = pd.Series(['1.0', '2', -3])
pd.to_numeric(s)

0    1.0
1    2.0
2   -3.0
dtype: float64

In [37]:
df = pd.DataFrame({'year': [2015, 2016],
                   'month': [2, 3],
                   'day': [4, 5]})
pd.to_datetime(df)

0   2015-02-04
1   2016-03-05
dtype: datetime64[ns]

In [42]:
pd.to_timedelta('15.5us')

Timedelta('0 days 00:00:00.000015500')

In [40]:
pd.date_range(start='1/1/2021', end='1/08/2021')

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06', '2021-01-07', '2021-01-08'],
              dtype='datetime64[ns]', freq='D')

In [44]:
pd.timedelta_range(start='1 day', periods=4)

TimedeltaIndex(['1 days', '2 days', '3 days', '4 days'], dtype='timedelta64[ns]', freq='D')

In [45]:
pd.interval_range(start=0, end=5)

IntervalIndex([(0, 1], (1, 2], (2, 3], (3, 4], (4, 5]],
              closed='right',
              dtype='interval[int64]')

In [46]:
pd.Index(["foo", "bar", "baz"]) == "foo"

array([ True, False, False])

In [52]:
foo = pd.Categorical(['a', 'b'], categories=['a', 'b', 'c'])
bar = pd.Categorical(['d', 'e'], categories=['d', 'e', 'f'])
pd.crosstab(foo, bar)

col_0  d  e
row_0
a      1  0
b      0  1

In [55]:
pd.crosstab(foo, bar, dropna=False)

col_0  d  e  f
row_0
a      1  0  0
b      0  1  0
c      0  0  0

In [66]:
import pandas as pd
  
# creating a dataframe
df = pd.DataFrame({'A': ['xxx', 'yyy', 'zzz'],
      'B': ['Masters', 'Graduate', 'Graduate'],
      'C': [27, 23, 21]})
  
df
df.pivot('A', 'B', 'C')

B    Graduate  Masters
A
xxx       NaN     27.0
yyy      23.0      NaN
zzz      21.0      NaN

In [9]:
import pandas as pd 
data = pd.read_csv("amazon.csv") 
data.head()

        Amazon  Revenue
0        Prime       90
1       Kindle       80
2  Onlinestore       75
3         Echo       60
4        Alexa       53